# 1. Напишите программу, которая выведет числа от 1 до 10, 
# и если число равно 7, то дополнительно выведет надпись - "7 - счастливое число". 
# (Задание со звездочкой - попробуйте составить эту программу с использованием continue)

import pprint

for i in range(1, 11):
	if i in (7,3):
		print(f"lucky number is {i}")	
		continue

	print(f"number is {i}")

# 2. Создайте пустой список. Пока длина этого списка не станет равна 10 - 
# наполняйте его числами начиная с нуля 
# и увеличивая значение этого числа каждый раз на три. В конце выведите получившийся список

li = []
current = 0

for i in range(10):
	li.append(current)

	current += 3

print(li)	


