# -*- coding: UTF-8 -*-
# 9. Компрехеншены
# Скопируйте любой абзац текста из интернета и сохраните его как многострочную строку. 
# Создайте с помошью лист-компрехеншена модифицированный текст, 
# каждое слово в котором заканчивалось бы какой-то дополнительной частицей речи (например ругательством:)

import re

s = '''В  этом примере мы сперва перебираем people, присваивая каждый словарь person. 
После этого перебираем каждый идентификатор в словаре, присваивая ключи term. 
Если значение term равно birthday, то значение person[term] добавляет в list comprehension.'''

lines=re.split(r'\s+', s)
print(lines)

new_l = list(x+"NOWAY" for x in re.split(r'\s+', s))

print(new_l)

